RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_rtc.c
/**
 *******************************************************************************
 * @file  hc32f4a0_rtc.c
 * @brief This file provides firmware functions to manage the Real-Time
 *        Clock(RTC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Yangjp          First version
   2020-09-04       Yangjp          Optimize timeout handling in functions
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_rtc.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_RTC RTC
 * @brief Real-Time Clock Driver Library
 * @{
 */

#if (DDL_RTC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup RTC_Local_Macros RTC Local Macros
 * @{
 */

/* RTC TPCR register Mask */
#define RTC_TPCR_CLEAR_MASK                 (RTC_TPCR0_TPCT0   | RTC_TPCR0_TPNF0 | \
                                             RTC_TPCR0_TPRSTE0 | RTC_TPCR0_TSTPE0)

/* Get the specified register address of the RTC Intrusion Control */
#define RTC_TPCRx(__CH__)                   ((uint32_t)(&(M4_RTC->TPCR0)) + (uint32_t)(__CH__))

/* RTC software reset timeout(ms) */
#define RTC_SOFTWARE_RESET_TIMEOUT          (100UL)

/* RTC mode switch timeout(ms) */
#define RTC_MODE_SWITCH_TIMEOUT             (100UL)

/**
 * @defgroup RTC_Check_Parameters_Validity RTC Check Parameters Validity
 * @{
 */
#define IS_RTC_DATA_FORMAT(x)                                                  \
(   ((x) == RTC_DATA_FORMAT_DEC)                    ||                         \
    ((x) == RTC_DATA_FORMAT_BCD))

#define IS_RTC_CLOCK_SOURCE(x)                                                 \
(   ((x) == RTC_CLOCK_SOURCE_XTAL32)                ||                         \
    ((x) == RTC_CLOCK_SOURCE_RTCLRC))

#define IS_RTC_HOUR_FORMAT(x)                                                  \
(   ((x) == RTC_HOUR_FORMAT_12)                     ||                         \
    ((x) == RTC_HOUR_FORMAT_24))

#define IS_RTC_PERIOD_INTERRUPT(x)                                             \
(   ((x) == RTC_PERIOD_INT_INVALID)                 ||                         \
    ((x) == RTC_PERIOD_INT_HALF_SECOND)             ||                         \
    ((x) == RTC_PERIOD_INT_ONE_SECOND)              ||                         \
    ((x) == RTC_PERIOD_INT_ONE_MINUTE)              ||                         \
    ((x) == RTC_PERIOD_INT_ONE_HOUR)                ||                         \
    ((x) == RTC_PERIOD_INT_ONE_DAY)                 ||                         \
    ((x) == RTC_PERIOD_INT_ONE_MONTH))

#define IS_RTC_CLOCK_COMPEN(x)                                                 \
(   ((x) == RTC_CLOCK_COMPEN_DISABLE)               ||                         \
    ((x) == RTC_CLOCK_COMPEN_ENABLE))

#define IS_RTC_OUTPUT_COMPEN_MODE(x)                                           \
(   ((x) == RTC_OUTPUT_COMPEN_MODE_DISTRIBUTED)     ||                         \
    ((x) == RTC_OUTPUT_COMPEN_MODE_UNIFORM))

#define IS_RTC_HOUR12_AM_PM(x)                                                 \
(   ((x) == RTC_HOUR12_AM_HOUR24)                   ||                         \
    ((x) == RTC_HOUR12_PM))

#define IS_RTC_INTRUSION_CHANNEL(x)                                            \
(   ((x) == RTC_INTRU_CH0)                          ||                         \
    ((x) == RTC_INTRU_CH1))

#define IS_RTC_INTRUSION_TIMESTAMP(x)                                          \
(   ((x) == RTC_INTRU_TIMESTAMP_DISABLE)            ||                         \
    ((x) == RTC_INTRU_TIMESTAMP_ENABLE))

#define IS_RTC_RESET_BACKUP_REGISTER(x)                                        \
(   ((x) == RTC_RESET_BACKUP_REG_DISABLE)           ||                         \
    ((x) == RTC_RESET_BACKUP_REG_ENABLE))

#define IS_RTC_INTRUSION_FILTER(x)                                             \
(   ((x) == RTC_INTRU_FILTER_INVALID)               ||                         \
    ((x) == RTC_INTRU_FILTER_THREE_TIME)            ||                         \
    ((x) == RTC_INTRU_FILTER_THREE_TIME_CLK_DIV32))

#define IS_RTC_INTRUSION_DETECT_EDGE(x)                                        \
(   ((x) == RTC_DETECT_EDGE_NONE)                   ||                         \
    ((x) == RTC_DETECT_EDGE_RISING)                 ||                         \
    ((x) == RTC_DETECT_EDGE_FALLING)                ||                         \
    ((x) == RTC_DETECT_EDGE_RISING_FALLING))

#define IS_RTC_GET_FLAG(x)                                                     \
(   (0UL != (x))                                    &&                         \
    (0UL == ((x) & ((uint32_t)(~(RTC_FLAG_PRDF      |                          \
                                RTC_FLAG_ALMF       |                          \
                                RTC_FLAG_RWEN       |                          \
                                RTC_FLAG_TPOVF      |                          \
                                RTC_FLAG_TPF0       |                          \
                                RTC_FLAG_TPF1))))))

#define IS_RTC_CLEAR_FLAG(x)                                                   \
(   (0UL != (x))                                    &&                         \
    (0UL == ((x) & ((uint32_t)(~(RTC_FLAG_PRDF      |                          \
                                 RTC_FLAG_ALMF      |                          \
                                 RTC_FLAG_TPOVF     |                          \
                                 RTC_FLAG_TPF0      |                          \
                                 RTC_FLAG_TPF1))))))

