RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_rtc.c
#define IS_RTC_INTERRUPT(x)                                                    \
(   (0UL != (x))                                    &&                         \
    (0UL == ((x) & ((uint32_t)(~(RTC_INT_PRDIE      |                          \
                                 RTC_INT_ALMIE      |                          \
                                 RTC_INT_TPIE0      |                          \
                                 RTC_INT_TPIE1))))))

#define IS_RTC_YEAR(x)                              ((x) <= 99U)

#define IS_RTC_MONTH(x)                             (((x) >= 1U) && ((x) <= 12U))

#define IS_RTC_DAY(x)                               (((x) >= 1U) && ((x) <= 31U))

#define IS_RTC_HOUR12(x)                            (((x) >= 1U) && ((x) <= 12U))

#define IS_RTC_HOUR24(x)                            ((x) <= 23U)

#define IS_RTC_MINUTE(x)                            ((x) <= 59U)

#define IS_RTC_SECOND(x)                            ((x) <= 59U)

#define IS_RTC_WEEKDAY(x)                           ((x) <= 6U)

#define IS_RTC_ALARM_WEEKDAY(x)                     (((x) >= 0x01U) && ((x) <= 0x7FU))

#define IS_RTC_COMPENSATION_VALUE(x)                ((x) <= 0x1FFU)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup RTC_Global_Functions RTC Global Functions
 * @{
 */

/**
 * @brief  De-Initialize RTC.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorTimeout: De-Initialize timeout
 */
en_result_t RTC_DeInit(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    WRITE_REG32(bM4_RTC->CR0_b.RESET, Reset);
    /* Waiting for normal count status or end of RTC software reset */
    u32Count = RTC_SOFTWARE_RESET_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bM4_RTC->CR0_b.RESET))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    if (Ok == enRet)
    {
        /* Reset all RTC registers */
        WRITE_REG32(bM4_RTC->CR0_b.RESET, Set);
        /* Waiting for RTC software reset to complete */
        u32Count = RTC_SOFTWARE_RESET_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32(bM4_RTC->CR0_b.RESET))
        {
            if (0UL == u32Count)
            {
                enRet = ErrorTimeout;
                break;
            }
            u32Count--;
        }
    }

    return enRet;
}

/**
 * @brief  Initialize RTC.
 * @param  [in] pstcRtcInit             Pointer to a @ref stc_rtc_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_Init(const stc_rtc_init_t *pstcRtcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_CLOCK_SOURCE(pstcRtcInit->u8ClockSource));
        DDL_ASSERT(IS_RTC_HOUR_FORMAT(pstcRtcInit->u8HourFormat));
        DDL_ASSERT(IS_RTC_PERIOD_INTERRUPT(pstcRtcInit->u8PeriodInterrupt));
        DDL_ASSERT(IS_RTC_CLOCK_COMPEN(pstcRtcInit->u8ClkCompenEn));
        DDL_ASSERT(IS_RTC_COMPENSATION_VALUE(pstcRtcInit->u16ClkCompenValue));
        DDL_ASSERT(IS_RTC_OUTPUT_COMPEN_MODE(pstcRtcInit->u8CompenMode));

        /* RTC CR3 Configuration */
        MODIFY_REG8(M4_RTC->CR3, (RTC_CR3_LRCEN | RTC_CR3_RCKSEL), pstcRtcInit->u8ClockSource);
        /* RTC CR1 Configuration */
        MODIFY_REG8(M4_RTC->CR1, (RTC_CR1_PRDS | RTC_CR1_AMPM | RTC_CR1_ONEHZSEL),
                    (pstcRtcInit->u8PeriodInterrupt | pstcRtcInit->u8HourFormat | pstcRtcInit->u8CompenMode));
        /* RTC Compensation Configuration */
        MODIFY_REG8(M4_RTC->ERRCRH, (RTC_ERRCRH_COMPEN | RTC_ERRCRH_COMP8),
                    (pstcRtcInit->u8ClkCompenEn | (uint8_t)((pstcRtcInit->u16ClkCompenValue >> 8U) & 0x01U)));
        WRITE_REG8(M4_RTC->ERRCRL, (uint8_t)(pstcRtcInit->u16ClkCompenValue & 0xFFU));
    }

    return enRet;
}

/**
 * @brief  Fills each stc_rtc_init_t member with default value.
 * @param  [out] pstcRtcInit            Pointer to a @ref stc_rtc_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: stc_rtc_init_t member initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_StructInit(stc_rtc_init_t *pstcRtcInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcRtcInit->u8ClockSource      = RTC_CLOCK_SOURCE_RTCLRC;
        pstcRtcInit->u8HourFormat       = RTC_HOUR_FORMAT_24;
        pstcRtcInit->u8PeriodInterrupt  = RTC_PERIOD_INT_INVALID;
        pstcRtcInit->u8ClkCompenEn      = RTC_CLOCK_COMPEN_DISABLE;
        pstcRtcInit->u16ClkCompenValue  = 0U;
        pstcRtcInit->u8CompenMode       = RTC_OUTPUT_COMPEN_MODE_DISTRIBUTED;
    }

    return enRet;
}

/**
 * @brief  Enter RTC read/write mode.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Enter mode success
 *           - ErrorTimeout: Enter mode timeout
 */
en_result_t RTC_EnterRwMode(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    /* Mode switch when RTC is running */
    if (0UL != READ_REG32(bM4_RTC->CR1_b.START))
    {
        if (1UL != READ_REG32(bM4_RTC->CR2_b.RWEN))
        {
            WRITE_REG32(bM4_RTC->CR2_b.RWREQ, Set);
            /* Waiting for RWEN bit set */
            u32Count = RTC_MODE_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (1UL != READ_REG32(bM4_RTC->CR2_b.RWEN))
            {
                if (0UL == u32Count)
                {
                    enRet = ErrorTimeout;
                    break;
                }
                u32Count--;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Exit RTC read/write mode.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Exit mode success
 *           - ErrorTimeout: Exit mode timeout
 */
en_result_t RTC_ExitRwMode(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    /* Mode switch when RTC is running */
    if (0UL != READ_REG32(bM4_RTC->CR1_b.START))
    {
        if (0UL != READ_REG32(bM4_RTC->CR2_b.RWEN))
        {
            WRITE_REG32(bM4_RTC->CR2_b.RWREQ, Reset);
            /* Waiting for RWEN bit reset */
            u32Count = RTC_MODE_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (0UL != READ_REG32(bM4_RTC->CR2_b.RWEN))
            {
                if (0UL == u32Count)
                {
                    enRet = ErrorTimeout;
                    break;
                }
                u32Count--;
            }
        }
    }

    return enRet;
}

/**
 * @brief  RTC period interrupt config.
 * @param  [in] u8IntCond               Specifies the period interrupt type
 *         This parameter can be one of the following values:
 *           @arg RTC_PERIOD_INT_INVALID:       Period interrupt invalid
 *           @arg RTC_PERIOD_INT_HALF_SECOND:   0.5 second period interrupt
 *           @arg RTC_PERIOD_INT_ONE_SECOND:    1 second period interrupt
 *           @arg RTC_PERIOD_INT_ONE_MINUTE:    1 minute period interrupt
 *           @arg RTC_PERIOD_INT_ONE_HOUR:      1 hour period interrupt
 *           @arg RTC_PERIOD_INT_ONE_DAY:       1 day period interrupt
 *           @arg RTC_PERIOD_INT_ONE_MONTH:     1 month period interrupt
 * @retval None
 */
void RTC_PeriodIntConfig(uint8_t u8IntCond)
{
    uint32_t u32RtcSta;
    uint32_t u32IntSta;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_PERIOD_INTERRUPT(u8IntCond));

