RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_rtc.c
    u32RtcSta = READ_REG32(bM4_RTC->CR1_b.START);
    u32IntSta = READ_REG32(bM4_RTC->CR2_b.PRDIE);
    /* Disable period interrupt when START=1 and clear period flag after write */
    if ((0UL != u32IntSta) && (0UL != u32RtcSta))
    {
        WRITE_REG32(bM4_RTC->CR2_b.PRDIE, Reset);
    }

    /* RTC CR1 Configuration */
    MODIFY_REG8(M4_RTC->CR1, RTC_CR1_PRDS, u8IntCond);
    WRITE_REG32(bM4_RTC->CR2_b.PRDF, Reset);

    if ((0UL != u32IntSta) && (0UL != u32RtcSta))
    {
        WRITE_REG32(bM4_RTC->CR2_b.PRDIE, Set);
    }
}

/**
 * @brief  RTC enter low power condition check.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: Can enter low power mode
 *           - ErrorTimeout: Can't enter low power mode
 */
en_result_t RTC_LowPowerCheck(void)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    /* Check RTC work status */
    if (0UL != READ_REG32(bM4_RTC->CR1_b.START))
    {
        WRITE_REG32(bM4_RTC->CR2_b.RWREQ, Set);
        /* Waiting for RTC RWEN bit set */
        u32Count = RTC_MODE_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (1UL != READ_REG32(bM4_RTC->CR2_b.RWEN))
        {
            if (0UL == u32Count)
            {
                enRet = ErrorTimeout;
                break;
            }
            u32Count--;
        }

        if (Ok == enRet)
        {
            WRITE_REG32(bM4_RTC->CR2_b.RWREQ, Reset);
            /* Waiting for RTC RWEN bit reset */
            u32Count = RTC_MODE_SWITCH_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (0UL != READ_REG32(bM4_RTC->CR2_b.RWEN))
            {
                if (0UL == u32Count)
                {
                    enRet = ErrorTimeout;
                    break;
                }
                u32Count--;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set RTC clock compensation value.
 * @param  [in] u16CompenVal            Specifies the clock compensation value of RTC.
 *           @arg This parameter can be a number between Min_Data = 0 and Max_Data = 0x1FF.
 * @retval None
 */
void RTC_SetClkCompenValue(uint16_t u16CompenVal)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_COMPENSATION_VALUE(u16CompenVal));

    WRITE_REG32(bM4_RTC->ERRCRH_b.COMP8, ((uint32_t)u16CompenVal >> 8U) & 0x01U);
    WRITE_REG8(M4_RTC->ERRCRL, (uint8_t)(u16CompenVal & 0x00FFU));
}

/**
 * @brief  Enable or disable RTC count.
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_Cmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_RTC->CR1_b.START, enNewSta);
}

/**
 * @brief  Enable or disable RTC LRC function.
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_LrcCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_RTC->CR3_b.LRCEN, enNewSta);
}

/**
 * @brief  Get RTC counter status.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Enable: RTC counter started
 *           - Disable: RTC counter stopped
 */
en_functional_state_t RTC_GetCounterState(void)
{
    en_functional_state_t enState;

    if (0UL != READ_REG32(bM4_RTC->CR1_b.START))
    {
        enState = Enable;
    }
    else
    {
        enState = Disable;
    }

    return enState;
}

/**
 * @brief  Enable or disable RTC 1HZ output.
 * @param  [in] enNewSta                 The function new state.
 *          @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_OneHzOutputCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_RTC->CR1_b.ONEHZOE, enNewSta);
}

/**
 * @brief  Enable or disable clock compensation.
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_ClkCompenCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_RTC->ERRCRH_b.COMPEN, enNewSta);
}

/**
 * @brief  Set RTC current date.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [in] pstcRtcDate             Pointer to a @ref stc_rtc_date_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Set date success
 *           - Error: Set date failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_SetDate(uint8_t u8Format, stc_rtc_date_t *pstcRtcDate)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcDate)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));
        if (RTC_DATA_FORMAT_DEC != u8Format)
        {
            DDL_ASSERT(IS_RTC_YEAR(BCD2DEC(pstcRtcDate->u8Year)));
            DDL_ASSERT(IS_RTC_MONTH(BCD2DEC(pstcRtcDate->u8Month)));
            DDL_ASSERT(IS_RTC_DAY(BCD2DEC(pstcRtcDate->u8Day)));
        }
        else
        {
            DDL_ASSERT(IS_RTC_YEAR(pstcRtcDate->u8Year));
            DDL_ASSERT(IS_RTC_MONTH(pstcRtcDate->u8Month));
            DDL_ASSERT(IS_RTC_DAY(pstcRtcDate->u8Day));
        }
        DDL_ASSERT(IS_RTC_WEEKDAY(pstcRtcDate->u8Weekday));

        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcDate->u8Year  = DEC2BCD(pstcRtcDate->u8Year);
                pstcRtcDate->u8Month = DEC2BCD(pstcRtcDate->u8Month);
                pstcRtcDate->u8Day   = DEC2BCD(pstcRtcDate->u8Day);
            }

            WRITE_REG8(M4_RTC->YEAR, pstcRtcDate->u8Year);
            WRITE_REG8(M4_RTC->MON,  pstcRtcDate->u8Month);
            WRITE_REG8(M4_RTC->DAY,  pstcRtcDate->u8Day);
            WRITE_REG8(M4_RTC->WEEK, pstcRtcDate->u8Weekday);

