RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_rtc.c
            /* Exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Get RTC current date.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [out] pstcRtcDate            Pointer to a @ref stc_rtc_date_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Get date success
 *           - Error: Get date failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetDate(uint8_t u8Format, stc_rtc_date_t *pstcRtcDate)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcDate)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));
        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            /* Get RTC date registers */
            pstcRtcDate->u8Year    = READ_REG8(M4_RTC->YEAR);
            pstcRtcDate->u8Month   = READ_REG8(M4_RTC->MON);
            pstcRtcDate->u8Day     = READ_REG8(M4_RTC->DAY);
            pstcRtcDate->u8Weekday = READ_REG8(M4_RTC->WEEK);

            /* Check decimal format*/
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcDate->u8Year  = BCD2DEC(pstcRtcDate->u8Year);
                pstcRtcDate->u8Month = BCD2DEC(pstcRtcDate->u8Month);
                pstcRtcDate->u8Day   = BCD2DEC(pstcRtcDate->u8Day);
            }

            /* exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set RTC current time.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [in] pstcRtcTime             Pointer to a @ref stc_rtc_time_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Set time success
 *           - Error: Set time failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_SetTime(uint8_t u8Format, stc_rtc_time_t *pstcRtcTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcTime)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));
        if (RTC_DATA_FORMAT_DEC != u8Format)
        {
            if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
            {
                DDL_ASSERT(IS_RTC_HOUR12(BCD2DEC(pstcRtcTime->u8Hour)));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcTime->u8AmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(BCD2DEC(pstcRtcTime->u8Hour)));
            }
            DDL_ASSERT(IS_RTC_MINUTE(BCD2DEC(pstcRtcTime->u8Minute)));
            DDL_ASSERT(IS_RTC_SECOND(BCD2DEC(pstcRtcTime->u8Second)));
        }
        else
        {
            if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
            {
                DDL_ASSERT(IS_RTC_HOUR12(pstcRtcTime->u8Hour));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcTime->u8AmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(pstcRtcTime->u8Hour));
            }
            DDL_ASSERT(IS_RTC_MINUTE(pstcRtcTime->u8Minute));
            DDL_ASSERT(IS_RTC_SECOND(pstcRtcTime->u8Second));
        }

        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcTime->u8Hour   = DEC2BCD(pstcRtcTime->u8Hour);
                pstcRtcTime->u8Minute = DEC2BCD(pstcRtcTime->u8Minute);
                pstcRtcTime->u8Second = DEC2BCD(pstcRtcTime->u8Second);
            }
            if ((RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM)) &&
                (RTC_HOUR12_PM == pstcRtcTime->u8AmPm))
            {
                pstcRtcTime->u8Hour |= RTC_HOUR12_PM;
            }

            WRITE_REG8(M4_RTC->HOUR, pstcRtcTime->u8Hour);
            WRITE_REG8(M4_RTC->MIN,  pstcRtcTime->u8Minute);
            WRITE_REG8(M4_RTC->SEC,  pstcRtcTime->u8Second);

            /* Exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Get RTC current time.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [out] pstcRtcTime            Pointer to a @ref stc_rtc_time_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Get time success
 *           - Error: Get time failed
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetTime(uint8_t u8Format, stc_rtc_time_t *pstcRtcTime)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcTime)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));
        /* Enter read/write mode */
        if (Ok != RTC_EnterRwMode())
        {
            enRet = Error;
        }
        else
        {
            /* Get RTC time registers */
            pstcRtcTime->u8Hour   = READ_REG8(M4_RTC->HOUR);
            pstcRtcTime->u8Minute = READ_REG8(M4_RTC->MIN);
            pstcRtcTime->u8Second = READ_REG8(M4_RTC->SEC);

