RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_rtc.c
            if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
            {
                if (RTC_HOUR12_PM == (pstcRtcTime->u8Hour & RTC_HOUR12_PM))
                {
                    pstcRtcTime->u8Hour &= (uint8_t)(~RTC_HOUR12_PM);
                    pstcRtcTime->u8AmPm  = RTC_HOUR12_PM;
                }
                else
                {
                    pstcRtcTime->u8AmPm = RTC_HOUR12_AM_HOUR24;
                }
            }
            else
            {
                pstcRtcTime->u8AmPm = RTC_HOUR12_AM_HOUR24;
            }

            /* Check decimal format*/
            if (RTC_DATA_FORMAT_DEC == u8Format)
            {
                pstcRtcTime->u8Hour   = BCD2DEC(pstcRtcTime->u8Hour);
                pstcRtcTime->u8Minute = BCD2DEC(pstcRtcTime->u8Minute);
                pstcRtcTime->u8Second = BCD2DEC(pstcRtcTime->u8Second);
            }

            /* exit read/write mode */
            if (Ok != RTC_ExitRwMode())
            {
                enRet = Error;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Set RTC alarm time.
 * @param  [in] u8Format                Specifies the format of the entered parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [in] pstcRtcAlarm            Pointer to a @ref stc_rtc_alarm_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Set RTC alarm time success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_SetAlarm(uint8_t u8Format, stc_rtc_alarm_t *pstcRtcAlarm)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcAlarm)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));
        if (RTC_DATA_FORMAT_DEC != u8Format)
        {
            if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
            {
                DDL_ASSERT(IS_RTC_HOUR12(BCD2DEC(pstcRtcAlarm->u8AlarmHour)));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcAlarm->u8AlarmAmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(BCD2DEC(pstcRtcAlarm->u8AlarmHour)));
            }
            DDL_ASSERT(IS_RTC_MINUTE(BCD2DEC(pstcRtcAlarm->u8AlarmMinute)));
        }
        else
        {
            if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
            {
                DDL_ASSERT(IS_RTC_HOUR12(pstcRtcAlarm->u8AlarmHour));
                DDL_ASSERT(IS_RTC_HOUR12_AM_PM(pstcRtcAlarm->u8AlarmAmPm));
            }
            else
            {
                DDL_ASSERT(IS_RTC_HOUR24(pstcRtcAlarm->u8AlarmHour));
            }
            DDL_ASSERT(IS_RTC_MINUTE(pstcRtcAlarm->u8AlarmMinute));
        }
        DDL_ASSERT(IS_RTC_ALARM_WEEKDAY(pstcRtcAlarm->u8AlarmWeekday));

        /* Configure alarm registers */
        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            pstcRtcAlarm->u8AlarmHour   = DEC2BCD(pstcRtcAlarm->u8AlarmHour);
            pstcRtcAlarm->u8AlarmMinute = DEC2BCD(pstcRtcAlarm->u8AlarmMinute);
        }
        if ((RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM)) &&
            (RTC_HOUR12_PM == pstcRtcAlarm->u8AlarmAmPm))
        {
            pstcRtcAlarm->u8AlarmHour |= RTC_HOUR12_PM;
        }

        WRITE_REG8(M4_RTC->ALMHOUR, pstcRtcAlarm->u8AlarmHour);
        WRITE_REG8(M4_RTC->ALMMIN,  pstcRtcAlarm->u8AlarmMinute);
        WRITE_REG8(M4_RTC->ALMWEEK, pstcRtcAlarm->u8AlarmWeekday);
    }

    return enRet;
}

/**
 * @brief  Get RTC alarm time.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [out] pstcRtcAlarm           Pointer to a @ref stc_rtc_alarm_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Get RTC alarm time success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetAlarm(uint8_t u8Format, stc_rtc_alarm_t *pstcRtcAlarm)
{
    en_result_t enRet = Ok;

    if (NULL == pstcRtcAlarm)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        /* Get RTC date and time register */
        pstcRtcAlarm->u8AlarmWeekday = READ_REG8(M4_RTC->ALMWEEK);
        pstcRtcAlarm->u8AlarmMinute  = READ_REG8(M4_RTC->ALMMIN);
        pstcRtcAlarm->u8AlarmHour    = READ_REG8(M4_RTC->ALMHOUR);

        if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
        {
            if (RTC_HOUR12_PM == (pstcRtcAlarm->u8AlarmHour & RTC_HOUR12_PM))
            {
                pstcRtcAlarm->u8AlarmHour &= (uint8_t)(~RTC_HOUR12_PM);
                pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR12_PM;
            }
            else
            {
                pstcRtcAlarm->u8AlarmAmPm = RTC_HOUR12_AM_HOUR24;
            }
        }

        /* Check decimal format*/
        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            pstcRtcAlarm->u8AlarmHour   = BCD2DEC(pstcRtcAlarm->u8AlarmHour);
            pstcRtcAlarm->u8AlarmMinute = BCD2DEC(pstcRtcAlarm->u8AlarmMinute);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable RTC alarm.
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_AlarmCmd(en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    WRITE_REG32(bM4_RTC->CR2_b.ALME, enNewSta);
}

/**
 * @brief  Configure RTC intrusion function.
 * @param  [in] u8Ch                    Specifies the RTC intrusion channel.
 *         This parameter can be one of the following values:
 *           @arg RTC_INTRU_CH0:    Intrusion channel 0
 *           @arg RTC_INTRU_CH1:    Intrusion channel 1
 * @param  [in] pstcIntru               Pointer to a @ref stc_rtc_intrusion_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure RTC intrusion function success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_IntrusionConfig(uint8_t u8Ch, const stc_rtc_intrusion_t *pstcIntru)
{
    en_result_t enRet = Ok;
    __IO uint8_t *TPCR;

    if (NULL == pstcIntru)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_INTRUSION_CHANNEL(u8Ch));
        DDL_ASSERT(IS_RTC_INTRUSION_TIMESTAMP(pstcIntru->u8TimeStampEn));
        DDL_ASSERT(IS_RTC_RESET_BACKUP_REGISTER(pstcIntru->u8ResetBackupRegEn));
        DDL_ASSERT(IS_RTC_INTRUSION_FILTER(pstcIntru->u8Filter));
        DDL_ASSERT(IS_RTC_INTRUSION_DETECT_EDGE(pstcIntru->u8TrigEdge));

        TPCR = (__IO uint8_t *)RTC_TPCRx(u8Ch);
        /* RTC Intrusion control Configuration */
        MODIFY_REG8(*TPCR, RTC_TPCR_CLEAR_MASK,
                    (pstcIntru->u8TimeStampEn | pstcIntru->u8ResetBackupRegEn |
                     pstcIntru->u8Filter      | pstcIntru->u8TrigEdge));
    }

    return enRet;
}

/**
 * @brief  Get RTC intrusion timestamp.
 * @param  [in] u8Format                Specifies the format of the returned parameters.
 *         This parameter can be one of the following values:
 *           @arg RTC_DATA_FORMAT_DEC:  Decimal data format
 *           @arg RTC_DATA_FORMAT_BCD:  BCD data format
 * @param  [out] pstcTimestamp          Pointer to a @ref stc_rtc_timestamp_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Get RTC intrusion timestamp success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t RTC_GetIntrusionTimestamp(uint8_t u8Format, stc_rtc_timestamp_t *pstcTimestamp)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTimestamp)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_RTC_DATA_FORMAT(u8Format));

        /* Get RTC Timestamp registers */
        pstcTimestamp->stcTSTime.u8Hour   = READ_REG8(M4_RTC->HOURTP);
        pstcTimestamp->stcTSTime.u8Minute = READ_REG8(M4_RTC->MINTP);
        pstcTimestamp->stcTSTime.u8Second = READ_REG8(M4_RTC->SECTP);
        pstcTimestamp->u8TSMonth          = READ_REG8(M4_RTC->MONTP);
        pstcTimestamp->u8TSDay            = READ_REG8(M4_RTC->DAYTP);

