RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_rtc.c
        if (RTC_HOUR_FORMAT_12 == READ_REG32(bM4_RTC->CR1_b.AMPM))
        {
            if (RTC_HOUR12_PM == (pstcTimestamp->stcTSTime.u8Hour & RTC_HOUR12_PM))
            {
                pstcTimestamp->stcTSTime.u8Hour &= (uint8_t)(~RTC_HOUR12_PM);
                pstcTimestamp->stcTSTime.u8AmPm  = RTC_HOUR12_PM;
            }
            else
            {
                pstcTimestamp->stcTSTime.u8AmPm = RTC_HOUR12_AM_HOUR24;
            }
        }
        else
        {
            pstcTimestamp->stcTSTime.u8AmPm = RTC_HOUR12_AM_HOUR24;
        }

        /* Check decimal format*/
        if (RTC_DATA_FORMAT_DEC == u8Format)
        {
            pstcTimestamp->stcTSTime.u8Hour   = BCD2DEC(pstcTimestamp->stcTSTime.u8Hour);
            pstcTimestamp->stcTSTime.u8Minute = BCD2DEC(pstcTimestamp->stcTSTime.u8Minute);
            pstcTimestamp->stcTSTime.u8Second = BCD2DEC(pstcTimestamp->stcTSTime.u8Second);
            pstcTimestamp->u8TSMonth          = BCD2DEC(pstcTimestamp->u8TSMonth);
            pstcTimestamp->u8TSDay            = BCD2DEC(pstcTimestamp->u8TSDay);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable RTC intrusion.
 * @param  [in] u8Ch                    Specifies the RTC intrusion channel.
 *         This parameter can be one of the following values:
 *           @arg RTC_INTRU_CH0:    Intrusion channel 0
 *           @arg RTC_INTRU_CH1:    Intrusion channel 1
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_IntrusionCmd(uint8_t u8Ch, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_INTRUSION_CHANNEL(u8Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (RTC_INTRU_CH0 != u8Ch)
    {
        WRITE_REG32(bM4_RTC->TPCR1_b.TPEN1, enNewSta);
    }
    else
    {
        WRITE_REG32(bM4_RTC->TPCR0_b.TPEN0, enNewSta);
    }
}

/**
 * @brief  Enable or disable specified RTC interrupt.
 * @param  [in] u32IntSrc               Specifies the RTC interrupt source.
 *         This parameter can be one or any combination of the following values:
 *           @arg RTC_INT_PRDIE:    Period interrupt
 *           @arg RTC_INT_ALMIE:    Alarm interrupt
 *           @arg RTC_INT_TPIE0:    RTCIC0 intrusion interrupt
 *           @arg RTC_INT_TPIE1:    RTCIC1 intrusion interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void RTC_IntCmd(uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_RTC_INTERRUPT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (0UL != (u32IntSrc & 0x0000FFUL))
    {
        if (Disable != enNewSta)
        {
            SET_REG8_BIT(M4_RTC->CR2, (u32IntSrc & 0x0000FFUL));
        }
        else
        {
            CLEAR_REG8_BIT(M4_RTC->CR2, (u32IntSrc & 0x0000FFUL));
        }
    }

    if (0UL != (u32IntSrc & 0x00FF00UL))
    {
        WRITE_REG32(bM4_RTC->TPCR0_b.TPIE0, enNewSta);
    }

    if (0UL != (u32IntSrc & 0xFF0000UL))
    {
        WRITE_REG32(bM4_RTC->TPCR1_b.TPIE1, enNewSta);
    }
}

/**
 * @brief  Get RTC flag status.
 * @param  [in] u32Flag                 Specifies the RTC flag type.
 *         This parameter can be one or any combination of the following values:
 *           @arg RTC_FLAG_PRDF:    Period flag
 *           @arg RTC_FLAG_ALMF:    Alarm flag
 *           @arg RTC_FLAG_RWEN:    Read and write permission flag
 *           @arg RTC_FLAG_TPOVF:   Intrusion overflow flag
 *           @arg RTC_FLAG_TPF0:    RTCIC0 intrusion flag
 *           @arg RTC_FLAG_TPF1:    RTCIC1 intrusion flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t RTC_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;
    uint8_t u8NormalFlag;
    uint8_t u8IntruFlag;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_GET_FLAG(u32Flag));

    u8NormalFlag = (uint8_t)(u32Flag & 0xFFU);
    u8IntruFlag  = (uint8_t)((u32Flag >> 16U) & 0xFFU);
    if (0U != u8NormalFlag)
    {
        if (0U != (READ_REG8_BIT(M4_RTC->CR2, u8NormalFlag)))
        {
            enFlagSta = Set;
        }
    }
    if ((0U != u8IntruFlag) && (Set != enFlagSta))
    {
        if (0U != (READ_REG8_BIT(M4_RTC->TPSR, u8IntruFlag)))
        {
            enFlagSta = Set;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Clear RTC flag.
 * @param  [in] u32Flag                 Specifies the RTC flag type.
 *         This parameter can be one or any combination of the following values:
 *           @arg RTC_FLAG_PRDF:    Period flag
 *           @arg RTC_FLAG_ALMF:    Alarm flag
 *           @arg RTC_FLAG_TPOVF:   Intrusion overflow flag
 *           @arg RTC_FLAG_TPF0:    RTCIC0 intrusion flag
 *           @arg RTC_FLAG_TPF1:    RTCIC1 intrusion flag
 * @retval None
 */
void RTC_ClearStatus(uint32_t u32Flag)
{
    uint8_t u8NormalFlag;
    uint8_t u8IntruFlag;

    /* Check parameters */
    DDL_ASSERT(IS_RTC_CLEAR_FLAG(u32Flag));

    u8NormalFlag = (uint8_t)(u32Flag & 0xFFU);
    u8IntruFlag  = (uint8_t)((u32Flag >> 16U) & 0xFFU);
    if (0U != u8NormalFlag)
    {
        CLEAR_REG8_BIT(M4_RTC->CR2, u8NormalFlag);
    }
    if (0U != u8IntruFlag)
    {
        CLEAR_REG8_BIT(M4_RTC->TPSR, u8IntruFlag);
    }
}

/**
 * @}
 */

#endif /* DDL_RTC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
